ERM/src/Catalogs/КостЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>КостЦентры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultActivity</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnlyMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxRegistration</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NonLawson</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/Catalogs/КостЦентры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	// Дозаполним реквизиты без обращений к СУБД
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим реквизиты без обращений к СУБД
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ);
	
	// Если случились ошибки - в целях оптимизации дальше ничего делать не будем
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Получим данные из СУБД и дозаполним реквизиты
	ДозаполнитьРеквизитыСДополнительнымиДанными();
	
	// Проверим реквизиты с учетом данных полученных из СУБД
	ПроверитьРеквизитыСДополнительнымиДанными(Отказ);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Код = СокрЛП(Код);
	Наименование = СокрЛП(Наименование);
	DefaultActivity = СокрЛП(DefaultActivity);
		
КонецПроцедуры

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""No."" is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сегмент) И Не (Source <> Перечисления.ТипыСоответствий.OracleMI Или Source <> Перечисления.ТипыСоответствий.OracleSmith) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Sub sub segment"" is empty!",
			ЭтотОбъект, "Сегмент", , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьРеквизитыСДополнительнымиДанными()
	
	// Определим и запомним родителя саб саб сегмента
	ДополнительныеСвойства.Вставить("SubSubSegmentРодитель", Неопределено);
	Если ЗначениеЗаполнено(Сегмент) Тогда
		ДополнительныеСвойства.SubSubSegmentРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сегмент, "Родитель");
	КонецЕсли;
	
	// Дозаполним саб сегмент по родителю саб саб сегмента
	Если НЕ ЗначениеЗаполнено(SubSegment) И ЗначениеЗаполнено(ДополнительныеСвойства.SubSubSegmentРодитель) Тогда
		SubSegment = ДополнительныеСвойства.SubSubSegmentРодитель;
	КонецЕсли;
	
	// Определим и запомним родителя саб сегмента
	ДополнительныеСвойства.Вставить("SubSegmentРодитель", Неопределено);
	Если ЗначениеЗаполнено(SubSegment) Тогда
		ДополнительныеСвойства.SubSegmentРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(SubSegment, "Родитель");
	КонецЕсли;
	
	// Дозаполним сегмент по родителю саб сегмента
	Если НЕ ЗначениеЗаполнено(Segment) И ЗначениеЗаполнено(ДополнительныеСвойства.SubSegmentРодитель) Тогда
		Segment = ДополнительныеСвойства.SubSegmentРодитель;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРеквизитыСДополнительнымиДанными(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Segment) Тогда
		
		// Родителем сегмента должна быть пустая ссылка
		// Но из-за ограничения уровней иерархии эта проверка все равно так или иначе сработает
		// Поэтому в целях оптимизации - не будем ее делать
		
	Иначе
		
		Если Не (Source <> Перечисления.ТипыСоответствий.OracleMI Или Source <> Перечисления.ТипыСоответствий.OracleSmith) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Segment"" is empty!",
				ЭтотОбъект, "Segment", , Отказ);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SubSegment) Тогда
		
		// Родителем саб сегмента должен быть сегмент
		Если ЗначениеЗаполнено(Segment) Тогда
			
			Если ДополнительныеСвойства.SubSegmentРодитель <> Segment Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"""Sub segment"" does not belog to Segment!",
					ЭтотОбъект, "SubSegment", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не (Source <> Перечисления.ТипыСоответствий.OracleMI Или Source <> Перечисления.ТипыСоответствий.OracleSmith) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Sub segment"" is empty!",
				ЭтотОбъект, "SubSegment", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сегмент) Тогда
		
		// Родителем саб саб сегмента должен быть саб сегмент
		Если ЗначениеЗаполнено(SubSegment) Тогда
			
			Если ДополнительныеСвойства.SubSubSegmentРодитель <> SubSegment Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"""Sub sub segment"" does not belog to Sub segment!",
					ЭтотОбъект, "SubSubSegment", , Отказ);
			КонецЕсли;
			
		КонецЕсли;	
			
	Иначе
		
		Если Не (Source <> Перечисления.ТипыСоответствий.OracleMI Или Source <> Перечисления.ТипыСоответствий.OracleSmith) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Sub sub segment"" is empty!",
				ЭтотОбъект, "Сегмент", , Отказ);
		КонецЕсли;	
			
	КонецЕсли;
	
	// Некоторые реквизиты могут проверяться только при интерактивной записи.
	
КонецПроцедуры

#КонецЕсли
